/**
 *
 * < 1강 : ExtJS 6 소개 >
 *
 * - **ExtJS 란?**
 *     - 수백까지 강력한 UI컴포넌트를 지원하는 javascript 프레임워크
 *
 * - **ExtJS 를 초기에 잘 사용하지 않은 이유**
 *     - 무겁고, 느리다.
 *     - 레퍼런스가 잘 없어서 참고하며 개발하기가 어려웠다.
 *
 * - **7가지 테마를 지원한다.**
 *     - Classic : 이전부터 존재한 클래식
 *     - Gray : 그레이 기반
 *     - Neptune : 4버전부터 등장
 *     - Crisp : 5버전부터 등장
 *     - Triton : 6버전부터 등장
 *
 * - **화면은 Json 구조로 되어있다.**
 *     - key, value 구조
 *
 * - **ExtJS 6의 새로워진 기능**
 *     - ExtJS(Classcic) 과 Sencna Touch(Modern) 통합
 *     - D3 Adapter - ExtJS 프리미어 버전부터 지원
 *         - 데이터 수치를 바인딩 받아서 확인하는 기능을 제공
 *
 * - **지원 브라우저**
 *     - IE 10, 11, Edge 12
 *     - Chrome 17 - 23 ~ 40+
 *     - Firefox 10 - 17 ~ 35+
 *     - Safari 6 ~ 9
 *     - Opera 12 ~ 27+
 *
 * - **ExtJS 6 진실과 오해**
 *     1. 무겁다 or 느리다.
 *         - 버전이 올라가면서 많이 개선되었다.
 *         - 물론 다른 프레임워크 보다는 좀 느릴 수 있다. 그러나 엄청 느리지는 않다.
 *     2. 배우는데 오래 걸린다.
 *         - 전문적인 기술 지원을 받기 어렵고, 강의나 레퍼런스가 많이 없다.
 *     3. 라이센스가 고가다.
 *         - 600만원 ~ 1,000만원 정도한다.
 *         - 비싸긴하다.
 *
 * - **ExtJS 는 어디에 쓰는게 좋을까?**
 *     - SI 프로젝트 및 기업용 솔루션 제품 개발
 *     - 무료 오픈 웹 어플리케이션
 *     - PC용 어플리케이션 화면구조와 유사한 UI를 고려할 경우
 *
 * - **ExtJS 를 국내에서 잘 사용하지 않는 이유?**
 *     - 국내 기술지원을 해줄 전문가가 부족함.
 *     - 잘 알려지지 않음.
 */